Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: You can access the minimum and maximum values of each integer type with its min and max properties:
ja: あなたは、そのminとmaxプロパティで各整数型の最小と最大の値を得ることができます：

source: You can access the properties of an instance using dot syntax.
ja: あなたは、ドット構文を使ってインスタンスのプロパティにアクセスすることができます。

source: You can add a new item into a set by calling the set’s insert(_:) method:
ja: あなたは新しい項目を集合に加えることが集合のinsert(_:)メソッドを呼ぶことによって行えます：

source: You can add a new item to a dictionary with subscript syntax.
ja: あなたは、添え字構文を使って辞書に新しい項目を付け加えることができます。

source: You can add a new item to the end of an array by calling the array’s append(_:) method:
ja: あなたは、配列のappend(_:)メソッドを呼ぶことによって配列の終わりに新しい項目を加えることができます：

source: You can add any number of additional branches using #elseif clauses.
ja: あなたは、任意の数の追加の分岐を加えることが#elseifを使って行えます。

source: You can add property observers to any stored properties you define, except for lazy stored properties.
ja: あなたは、プロパティオブザーバーをあなたが定義するどんな格納プロパティにでも加えることができます、しかし遅延格納プロパティは除きます。

source: You can add property observers to any stored property.
ja: あなたは、プロパティオブザーバーをどんな格納プロパティにでも加えることができます。

source: You can add protocol conformance to a previously declared type by adopting the protocol in an extension declaration of that type.
ja: あなたは、プロトコル準拠を以前に宣言された型に加えることが、その型の拡張宣言においてそのプロトコルを採用することによってできます。

source: You can add type constraints to an associated type in a protocol to require that conforming types satisfy those constraints.
ja: あなたは、型制約を関連型へとプロトコルの中で加えることで、準拠する型がそれら制約を満たすことを要求できます。

source: You can also add a final additional branch using an #else clause.
ja: あなたはまた、最後の追加の分岐を#else節を使って加えることができます。

source: You can also add new characteristics to the subclass.
ja: あなたは、また、新しい特徴をサブクラスに加えることができます。

source: You can also add property observers to any inherited property (whether stored or computed) by overriding the property within a subclass, as described in Overriding Property Observers.
ja: あなたは、また、プロパティオブザーバーをあらゆる継承されたプロパティ（格納されるか、計算されるかに関係なく）にでも加えることが、サブクラスの内部でプロパティをオーバーライドすることによって、プロパティオブザーバーのオーバーライドで記述されるように、可能です。

source: You can also add property observers to any inherited property (whether stored or computed) by overriding the property within a subclass.
ja: あなたはまた、プロパティオブザーバーを、どんな継承されたプロパティにでも（格納されるか、計算されるかに関係なく）、サブクラス内でそのプロパティをオーバーライドすることによって加えることができます。

source: You can also aggregate the conformance requirements of multiple protocols using protocol composition types, as described in Protocol Composition Type and Protocol Composition.
ja: あなたは、また、プロトコル合成型とプロトコル合成で記述されるように、複数のプロトコルの準拠要件をひとまとめにすることがプロトコル合成（コンポジション）型を使って可能です。

source: You can also append a String value to an existing String variable with the addition assignment operator (+=):
ja: あなたは、また、あるString値を既存のString変数に加算代入演算子（+=）を使って追加することができます：

source: You can also attempt to set a property’s value through optional chaining:
ja: あなたはまたプロパティの値をオプショナル連鎖を通して設定することを試みることができます：

source: You can also bind an arbitrary expression to a named value in a capture list.
ja: あなたはまた、ある任意の式を、キャプチャリストの中の名前をつけられた値と結び付けることができます。

source: You can also call the preconditionFailure(_:file:line:) [https://developer.apple.com/documentation/swift/1539374-preconditionfailure] function to indicate that a failure has occurred—for example, if the default case of a switch was taken, but all valid input data should have been handled by one of the switch’s other cases.
ja: あなたはまた、preconditionFailure(_:file:line:) [https://developer.apple.com/documentation/swift/1539374-preconditionfailure]関数を呼び出して失敗がすでに起こっていることを示すことができます — 例えば、あるスイッチ文の省略時のケース節が取られた、しかし全ての有効な入力データがそのスイッチ文の他のケース節の１つによって取り扱われてしまっている場合。

source: You can also check whether a one-sided range contains a particular value, as shown in the code below.
ja: あなたはまた、以下のコードで示すように、片側範囲が特定の値を含むかどうか調べることができます。

source: You can also combine opaque return types with generics.
ja: あなたはまた、不透明戻り型を総称体と結合できます。

source: You can also declare a stored variable or property with willSet and didSet observers.
ja: あなたは、また、willSetとdidSetオブザーバーをもつ格納変数やプロパティを宣言することができます。

source: You can also declare properties in the context of a protocol declaration, as described in Protocol Property Declaration.
ja: プロトコルプロパティ宣言で記述されるように、あなたはまた、プロトコル宣言の文脈において、プロパティを宣言することができます。

source: You can also declare subscripts in the context of a protocol declaration, as described in Protocol Subscript Declaration.
ja: プロトコル添え字宣言で記述されるように、あなたはまた、プロトコル宣言の文脈において添え字を宣言することができます。

source: You can also define a convenience initializer to create an instance of that class for a specific use case or input value type.
ja: あなたは、また、ある便宜イニシャライザを定義して、そのクラスのインスタンスを特定の使用状況のために作成したり、値型を入力することができます。

source: You can also define custom operators that begin with a dot (.).
ja: あなたはまた、１つのドット（.）で始まるあつらえの演算子を定義することができます。

source: You can also define functions inside the bodies of other functions, known as nested functions.
ja: あなたはまた、他の関数の本体の内側に関数を、入れ子にされた関数として知られるものを、定義することができます。

source: You can also define methods that are called on the type itself.
ja: あなたは、また、型それ自体の上で呼ばれるメソッドを定義することができます。

source: You can also define properties that belong to the type itself, not to any one instance of that type.
ja: あなたは、また、その型のどれかひとつのインスタンスにではなく、型それ自体に属しているいくらかのプロパティを定義することができます。

source: You can also define subscripts that are called on the type itself.
ja: あなたはまた、型それ自身の上で呼び出される添え字を定義できます。

source: You can also delegate from init to init!, although doing so will trigger an assertion if the init! initializer causes initialization to fail.
ja: あなたはまた、initからinit!へ委任することができます、もっともそうすることは、init!イニシャライザが初期化失敗の原因となるならば、ある表明を引き起こすことになります。

source: You can also extend a generic type to conditionally add functionality, as described in Extensions with a Generic Where Clause.
ja: あなたはまた総称体型を拡張することで条件付きの機能性を追加することができます、総称体where節を持つ拡張で記述されるように。

source: You can also initialize a dictionary with a dictionary literal, which has a similar syntax to the array literal seen earlier.
ja: あなたはまた、辞書リテラルで辞書を初期化することができます、それは以前に見た配列リテラルに似ている構文を持ちます。

source: You can also initialize a set with an array literal, as a shorthand way to write one or more values as a set collection.
ja: あなたはまた、１つ以上の値を集合コレクションとして書くための省略法として、集合を配列リテラルを使って初期化することができます。

source: You can also initialize an array with an array literal, which is a shorthand way to write one or more values as an array collection.
ja: あなたはまた配列リテラルを使って配列を初期化することができます、それは１つ以上の値を配列コレクションとして書くための短縮形の方法です。

source: You can also iterate over a dictionary to access its key-value pairs.
ja: あなたは、また、辞書の端から端まで繰り返して、その「キーと値」の対にアクセスすることができます。

source: You can also make the generic Stack type conform to the Container protocol:
ja: あなたは、また、総称体Stack型をContainerプロトコルに準拠させることができます：

source: You can also modify the inherited currentSpeed property of a Bicycle instance, and query the instance’s inherited description property:
ja: あなたはまた、あるBicycleインスタンスの継承されたcurrentSpeedプロパティを変更することが出来ます、そしてそのインスタンスの持つ継承されたdescriptionプロパティについて問い合わせることが出来ます：

source: You can also name the elements of a tuple type and use those names to refer to the values of the individual elements.
ja: あなたは、また、タプル型の要素に名をつけることができて、それらの名前を個々の要素の値に言及するために使用することができます。

source: You can also optionally define a type of value that the function will pass back as output when it is done, known as its return type.
ja: あなたはまた、随意にその関数が実行を終えたとき出力として逆に渡す値の型、その戻り型として知られるものを定義できます。

source: You can also override a subscript declaration inherited from a superclass.
ja: あなたはまた、スーパークラスから継承した添え字宣言をオーバーライドすることができます。

source: You can also provide arguments to the attribute when you apply it to a property, and those arguments are passed to the property wrapper’s initializer.
ja: あなたはまた引数いくつかを、属性に対して提供することが、それをあなたがプロパティに適用する時に行えます、そしてそれら引数は、プロパティラッパーのもつイニシャライザに渡されます。

source: You can also replace a type parameter with a type argument that is itself a specialized version of a generic type (provided it satisfies the appropriate constraints and requirements).
ja: あなたはまた、型パラメータを、それ自身が総称体型の特殊化版である型引数と置き換えることができます（それが適切な制約と要件を満たすという条件で）。

source: You can also retrieve an iterable collection of a dictionary’s keys or values by accessing its keys and values properties:
ja: あなたは、また、そのkeysとvaluesプロパティにアクセスすることによって、ある辞書のキーまたは値からなる、for-in文で繰り返し可能なコレクション（集まり）を取り出すことができます：

source: You can also set and modify the initial value for a stored property during initialization.
ja: あなたは、また、初期化のときに格納プロパティに対して最初の値を設定および修正することができます。

source: You can also specify the requirement that two types be identical, using the == operator.
ja: あなたはまた、==演算子を使用して、２つの型が同一であるという要件を指定することができます。

source: You can also subclass any open class that’s defined in a different module.
ja: あなたはまた、異なるモジュールにおいて定義されるどんな開放クラスにでもサブクラスを作れます。

source: You can also use for-in loops with numeric ranges.
ja: あなたまた、for-inループを数値範囲とともに使うことができます。

source: You can also use a declaration to extend the behavior of an existing named type and to import symbols into your program that are declared elsewhere.
ja: あなたは、また、ある宣言を使うことで、既存の名前付きの型の振るまいを拡張することや、どこか他で宣言されるシンボルをあなたのプログラムへインポートすることができます。

source: You can also use a generic where clause as part of an extension.
ja: あなたまた、総称体where節を拡張の一部として使うことができます。

source: You can also use a property wrapper to reuse code in the getter and setter of multiple properties.
ja: あなたはまたプロパティラッパーを使用して、複数のプロパティのゲッターとセッターでコードを再利用できます。

source: You can also use a raw value to find a corresponding case, if there is one, by calling the enumeration’s failable initializer, as in ExampleEnum(rawValue: 5), which returns an optional case.
ja: あなたはまた生の値を使用して対応するケース節を見つけることが、もしそれが１つあるならば、列挙の持つ失敗できるイニシャライザを呼ぶことによって可能です、例えばExampleEnum(rawValue: 5)のように、それはオプショナルのケース節を返します。

source: You can also use an asterisk (*) to indicate the availability of the declaration on all of the platform names listed above.
ja: あなたはまた、アスタリスク（*）を使って上でリストされるプラットホーム名の全てでその宣言の有効性を指し示すことができます。

source: You can also use an implicitly unwrapped optional with optional binding, to check and unwrap its value in a single statement:
ja: あなたは、また、暗黙的にアンラップされるオプショナルをオプショナル束縛とともに使うことができます、１つの文でその値を確認してアンラップするためには：

source: You can also use dot syntax to assign a new value to a variable property:
ja: あなたは、また、新しい値を変数プロパティに代入するためにドット構文を使うことができます：

source: You can also use optional chaining and optional binding to conditionally perform an operation on an optional expression.
ja: あなたはまたオプショナル連鎖とオプショナル束縛を使って、あるオプショナルの式に関して演算を条件付きで実行することができます。

source: You can also use optional chaining to call a method that returns a value of optional type, and to chain on that method’s return value if needed.
ja: あなたはまたオプショナル連鎖を使って、オプショナルの型の値を返すメソッドを呼び出すこと、そして必要ならば、そのメソッドの戻り値の上で連鎖することができます。

source: You can also use strings or floating-point numbers as the raw type of an enumeration.
ja: あなたはまた、列挙の生の型として、文字列または浮動小数点数を使うことができます。

source: You can also use strings to insert constants, variables, literals, and expressions into longer strings, in a process known as string interpolation.
ja: あなたはまた文字列を、文字列補間として知られているやり方で、定数、変数、リテラル、および式をより長い文字列に差し入れるために使うことができます。

source: You can also use subscript syntax to change a range of values at once, even if the replacement set of values has a different length than the range you are replacing.
ja: あなたは、また、添え字構文を使って、ある範囲の値を一度に変えることができます、たとえ代替の値一式があなたが置き換えている範囲と異なる長さを持つとしてもです。

source: You can also use subscript syntax to change the value associated with a particular key:
ja: あなたは、また、添え字構文を特定のキーと結びつけられる値を変えるために使うことができます：

source: You can also use subscript syntax to retrieve a value from the dictionary for a particular key.
ja: あなたは、また、添え字構文を特定のキーに対する値を辞書から取り出すために使うことができます。

source: You can also use type casting to check whether a type conforms to a protocol, as described in Checking for Protocol Conformance.
ja: あなたはまた、プロトコル準拠の確認で記述されるように、その型があるプロトコルに準拠しているどうか調べるために型キャストを使うことができます。

source: You can also write indirect before the beginning of the enumeration to enable indirection for all of the enumeration’s cases that have an associated value:
ja: あなたはまた、列挙の始まりの前にindirectを書くことで、列挙の持つケース節で関連値を持つもの全てに対して間接参照を可能にできます。

source: You can also write the type of a dictionary in shorthand form as [Key: Value].
ja: あなたはまた、辞書の型を[Key: Value]のような省略形で書くこともできます。

source: You can also write the type of an array in shorthand form as [Element].
ja: あなたは、また、短縮形形式で配列の型を[Element]のように書くことができます。

source: You can append a Character value to a String variable with the String type’s append() method:
ja: あなたは、Character値をString変数にそのString型のもつappend()メソッドを使って追加することができます：

source: You can apply a declaration attribute to declarations only.
ja: あなたは、宣言属性を宣言だけに適用することができます。

source: You can apply multiple available attributes on a single declaration to specify the declaration’s availability on different platforms and different versions of Swift.
ja: あなたは、複数のavailable属性を単一の宣言上に適用することで、その宣言の利用可能性を異なるプラットホームおよび異なるバージョンのスウィフトに関して指定することができます。

source: You can apply switch case attributes to switch cases only.
ja: あなたは、スイッチケース節属性をスイッチケース節のみに適用できます。

source: You can apply the @unknown attribute to the default case, which indicates that the default case should match only enumeration cases that are added in the future.
ja: あなたは@unknown属性をdefaultケース節に適用できます、それはそのdefaultケース節が、将来に加えられる列挙ケース節だけに合致すべきであることを指し示します。

source: You can apply the available attribute with the renamed and unavailable arguments to a type alias declaration, as shown below, to indicate that the name of a declaration changed between releases of a framework or library.
ja: あなたは、available属性をrenamedおよびunavailable属性とともに型エイリアス宣言に対して使うことで、下で示されるように、ある宣言の名前がフレームワークまたはライブラリのリリースの間に変わったことを指し示せます。

source: You can apply the optional modifier only to protocols that are marked with the objc attribute.
ja: あなたはoptional修飾子をobjc属性で印されるプロトコルだけに適用することができます。

source: You can apply type attributes to types only.
ja: あなたは、型属性を型だけに適用することができます。

source: You can assign a Residence instance to john.residence, so that it no longer has a nil value:
ja: あなたはjohn.residenceにResidenceインスタンスを代入することができます、それによってそれはもはやnil値を持ちません：

source: You can assign a value to a constant property at any point during initialization, as long as it is set to a definite value by the time initialization finishes.
ja: あなたは、それが初期化終了時にある明確な値に設定されさえするならば、ある値を初期化の間のどの時点ででも定数プロパティに割り当てることができます。

source: You can assign specific access levels to individual types (classes, structures, and enumerations), as well as to properties, methods, initializers, and subscripts belonging to those types.
ja: あなたは特定のアクセス水準を個々の型（クラス、構造体、および列挙）、それだけでなくそれらの型に属しているプロパティ、メソッド、イニシャライザ、そして添え字に、個別に割り当てることができます。

source: You can assign the same product a different type of barcode:
ja: あなたは、同じ商品を異なる型のバーゴードに割り当てることができます：

source: You can be confident that the string you are passed won’t be modified unless you modify it yourself.
ja: あなたは、あなたが渡される文字列があなたが自身でそれを修正しない限り修正されないことを確信することができます。

source: You can call self.init only from within an initializer.
ja: あなたは、self.initをイニシャライザ内からだけ呼ぶことができます。

source: You can call an instance of a dynamically callable type as if it’s a function that takes any number of arguments.
ja: あなたは動的callable型のインスタンスを、まるでそれがいくらかの数の引数を取る関数であるかのように呼び出せます。

source: You can call such functions with either a String or Substring value.
ja: あなたは、そのような関数をStringまたはSubstring値で呼出せます。

source: You can call the greet(person:) function multiple times with different input values.
ja: あなたは、異なる入力値を使ってgreet(person:)関数を複数回呼び出すことができます。

source: You can call the swapTwoInts(_:_:) function with two variables of type Int to swap their values.
ja: あなたは、swapTwoInts(_:_:)関数を、それらの値を交換する２つのInt型の変数で呼ぶことができます。

source: You can call the type(of:) function with an instance of a type to access that instance’s dynamic, runtime type as a value, as the following example shows:
ja: あなたは、ある型のインスタンスを使ってtype(of:)関数を呼び出して、そのインスタンスの持つ動的な、実行時の型にひとつの値としてアクセスできます、以下の例で示すように：

source: You can call this function to swap the values in two Int variables:
ja: あなたは、２つのInt変数の値を交換するためにこの関数を呼ぶことができます：

source: You can chain multiple if statements together to consider additional clauses.
ja: あなたは、複数のif文を一緒につないで追加の条項を考慮することができます。

source: You can change the value of an existing variable to another value of a compatible type.
ja: あなたは、既存の変数の値を、別の互換性を持つ型の値に変えることができます。

source: You can check for the existence of a value in the weak reference, just like any other optional value, and you will never end up with a reference to an invalid instance that no longer exists.
ja: 他のあらゆるオプショナルの値と同じように、あなたは弱い参照の中の値の存在について調べることができます、そして、あなたは既に存在しない無効なインスタンスへの参照に至ることは決してありません。

source: You can check that an index is valid before using it by comparing it to the array’s count property.
ja: あなたはあるインデックスが有効なことを、それを配列のcountプロパティと比較することによって、それを使う前に確認することができます。

source: You can check the different barcode types using a switch statement, similar to the example in Matching Enumeration Values with a Switch Statement.
ja: あなたは、異なるバーコード型それらを、列挙値をスイッチ文で照合するでの例に似たあるスイッチ文を使って調べることができます。

source: You can check whether an implicitly unwrapped optional is nil the same way you check a normal optional:
ja: あなたは、暗黙的にアンラップされるオプショナルがnilであるかどうかを確認することが、あなたが通常のオプショナルを調べるのと同じ方法で可能です。

source: You can combine compilation conditions using the logical operators &&, ||, and ! and use parentheses for grouping.
ja: あなたは、コンパイル条件を結合させることが論理演算子&&、||、そして!を使って可能です、そして丸括弧をグループにするのに使うことができます。

source: You can combine multiple logical operators to create longer compound expressions:
ja: あなたは、より長く複雑な式をつくるために複数の論理演算子を結合することができます：

source: You can combine multiple protocols into a single requirement with a protocol composition.
ja: あなたは、プロトコル合成を使って複数のプロトコルを１つの要件に結合することができます。

source: You can compare two tuples if they have the same type and the same number of values.
ja: あなたは、２つのタプルを比較することが、それらが同じ型と同じ数の値を持つならば可能です。

source: You can constrain a tuple pattern to match certain kinds of tuple types by using type annotations.
ja: あなたは、型注釈を使うことによって特定の種類のタプル型にマッチするようにタプルパターンに制約を加えることができます。

source: You can construct a new Matrix instance by passing an appropriate row and column count to its initializer:
ja: あなたは、そのイニシャライザに適切な行と列の数を渡すことによって新しいMatrixインスタンスを造ることができます：

source: You can create a new array by adding together two existing arrays with compatible types with the addition operator (+).
ja: あなたは、互換性を持つ型の２つの既存の配列を加算演算子（+）を使って一緒に加えることによって、新しい配列をつくることができます。

source: You can create an array that holds Int values, or an array that holds String values, or indeed an array for any other type that can be created in Swift.
ja: あなたは、Int値を保持する配列、またはString値を保持する配列、またはそれどころかスウィフトで作成可能なあらゆる他の型のためにも配列をつくることができます。

source: You can create an empty array of a certain type using initializer syntax:
ja: あなたは、特定の型の空の配列をイニシャライザ構文を使って作成できます：

source: You can create an empty set of a certain type using initializer syntax:
ja: あなたは特定の型の空の集合を初期化構文を使って作成することができます：

source: You can create an instance of the Player class for a new player, and see what happens when the player completes level one:
ja: あなたは、新しいプレーヤーのためにPlayerクラスのインスタンスをつくることができて、そのプレーヤーがレベル１を完了するとき、何が起こるか見ることができます：

source: You can create and print an HTMLElement instance as before:
ja: あなたは、HTMLElementインスタンスを前の通り作成して出力することができます：

source: You can create multidimensional arrays by nesting pairs of square brackets, where the name of the base type of the elements is contained in the innermost pair of square brackets.
ja: あなたは、角括弧の対を入れにすることによって多次元配列をつくることができます、そこで要素の基本型の名前は最も内側の角括弧の対の中に含まれます。

source: You can create tuples from any permutation of types, and they can contain as many different types as you like.
ja: あなたは、いろいろな型をどんな順列にしてタプルを作っても構いません、そして、それらはあなたが望むだけ多くの異なる型を含むことができます。

source: You can customize the initialization process with input parameters and optional property types, or by assigning constant properties during initialization, as described in the following sections.
ja: あなたは、以下の節で記述されるように、入力パラメータとオプショナルプロパティ型を使って、または初期化の間に定数プロパティを割り当てることによって、初期化処理を目的に合わせて作り変えることができます。

source: You can declare and implement your own custom operators in addition to the standard operators provided by Swift.
ja: あなたは、スウィフトによって提供される標準の演算子に加えて、あなた独自のあつらえの演算子を宣言して実装することができます。

source: You can declare multiple constants or multiple variables on a single line, separated by commas:
ja: あなたは複数の定数または複数の変数を、コンマで区切ることで１つの行に宣言することができます：

source: You can declare operators of three different fixities: infix, prefix, and postfix.
ja: あなたは、３つの異なる定着性の演算子を宣言することができます：接中辞、接頭辞、そして接尾辞。

source: You can decompose the tuple into temporary constants or variables as part of the iteration:
ja: あなたは、繰り返しの一部としてそのタプルを一時的な定数または変数に分解することができます：

source: You can define optional requirements for protocols.
ja: あなたは、オプショナル要件をプロトコルに対して定義できます。

source: You can define Swift enumerations to store associated values of any given type, and the value types can be different for each case of the enumeration if needed.
ja: あなたはスウィフト列挙を、どんな与えられた型の関連値でも格納するように定義することができます、そして値の型は列挙のケース節それぞれで異なっていることが可能です。

source: You can define a default value for any parameter in a function by assigning a value to the parameter after that parameter’s type.
ja: あなたは、ある関数のすべてのパラメータに対して省略時の値を定義することが、そのパラメーターの型の後でパラメーターに値を割り当てることによって可能です。

source: You can define a common set of related cases as part of one enumeration, each of which has a different set of values of appropriate types associated with it.
ja: あなたは、１つの列挙の一部として、関連したケース節のよくある集合を定義することができます、そのそれぞれはそれと結びつけられる適切な型の値の集合をそれぞれ別に持ちます。

source: You can define a convenience initializer to call a designated initializer from the same class as the convenience initializer with some of the designated initializer’s parameters set to default values.
ja: あなたは、ある便宜イニシャライザを定義して、同じクラスからある指定イニシャライザをその便宜イニシャライザとして呼び出し、その指定イニシャライザのパラメータのいくつかを省略時の値に設定することができます。

source: You can define anything from a simple utility function with a single unnamed parameter to a complex function with expressive parameter names and different parameter options.
ja: あなたは、ただ１つの無名のパラメータを持つ単純で便利な支援関数から、表現豊かなパラメータ名と種々のパラメータ・オプションを持つ複雑な関数まで何でも定義することができます。

source: You can define multiple related variables of the same type on a single line, separated by commas, with a single type annotation after the final variable name:
ja: あなたは同じ型の複数の関連した変数を、１行上に、コンマで区切って、型注釈を１つだけ最後の変数名の後につけて、定義することができます。

source: You can define multiple subscripts for a single type, and the appropriate subscript overload to use is selected based on the type of index value you pass to the subscript.
ja: あなたは１つの型のために複数の添え字を定義することができます、そしてあなたが添え字に渡すインデックス値の型に基づいて、使うのに適切な添え字のオーバーロードが選択されます。

source: You can define your own type constraints when creating custom generic types, and these constraints provide much of the power of generic programming.
ja: あなたは、独自の型制約をあつらえの総称体型を作成する時に定義することができます、そして、それらの制約は総称体プログラミングの力の多くを提供します。

source: You can delegate from init? to init! and vice versa, and you can override init? with init! and vice versa.
ja: あなたは、init?からinit!への委任およびその逆が行えます、そしてあなたはinit?をinit!でオーバーライドすること、およびその逆もできます。

source: You can do this even if that method does not define a return value.
ja: たとえそのメソッドが戻り値を定義しないとしても、あなたはこれをすることができます。

source: You can drill down into subproperties, such as the width property in the resolution property of a VideoMode:
ja: あなたは、下位プロパティへと掘り下っていくことができます、例えば、あるVideoModeのresolutionプロパティの中のwidthプロパティ：

source: You can efficiently perform fundamental set operations, such as combining two sets together, determining which values two sets have in common, or determining whether two sets contain all, some, or none of the same values.
ja: あなたは効率的に基本的な集合演算を実行することができます、例えば２つの集合を１つに結合する、２つの集合が共通して持つ値はどれか決定する、または２つの集合が同じ値のすべて、いくつか、または全く含まないかどうかを決定するなど。

source: You can explicitly add the objc attribute to a subclass that meets these criteria, to specify its Objective-C name as discussed below.
ja: あなたは、明示的にobjc属性をこの基準に合うサブクラスに適用して、下で議論されるように、それのObjective-C名を指定できます。

source: You can extend a class, structure, or enumeration in any access context in which the class, structure, or enumeration is available.
ja: あなたは、あるクラス、構造体、または列挙を拡張することが、そこにおいてそのクラス、構造体、または列挙が利用可能であるあらゆるアクセス文脈において可能です。
